Fixes for Graphs and Diagrams
